Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: Some objects contain references to other objects; these are called *containers*. Examples of containers are tuples, lists and dictionaries. The references are part of a container's value. In most cases, when we talk about the value of a container, we imply the values, not the identities of the contained objects; however, when we talk about the mutability of a container, only the identities of the immediately contained objects are implied. So, if an immutable container (like a tuple) contains a reference to a mutable object, its value changes if that mutable object is changed.
ru: Некоторые объекты содержат ссылки на другие объекты; они называются “контейнерами” . Примеры “контейнеров” – это кортежи, списки и словари. Ссылки являются частью значения контейнера. В большинстве случаев, когда мы говорим о значении контейнера, мы подразумеваем значения, а не идентификаторы хранимых объектов; однако, когда мы говорим о изменяемости/неизменяемости контейнера, подразумеваются только непосредственно хранимые объекты (тоесть сами идентификаторы, а не указываемые значения) . Поэтому, если неизменный контейнер (как, например, кортеж) содержит ссылку на изменяемый объект, то значение, получающееся в результате интерпретирования этого контейнера меняется, если меняется указываемый изменяемый объект.

source: Types affect almost all aspects of object behavior. Even the importance of object identity is affected in some sense: for immutable types, operations that compute new values may actually return a reference to any existing object with the same type and value, while for mutable objects this is not allowed. E.g., after ``a = 1; b = 1``, ``a`` and ``b`` may or may not refer to the same object with the value one, depending on the implementation, but after ``c = []; d = []``, ``c`` and ``d`` are guaranteed to refer to two different, unique, newly created empty lists. (Note that ``c = d = []`` assigns the same object to both ``c`` and ``d``.)
ru: Типы влияют почти на все аспекты поведения объекта. Даже идентичность объектов в какой-то степени подвержена этому влиянию: для неизменяемых типов, операции, которые вычисляют новые значения могут в действительности возвращать ссылку на какой-либо существующий объект такого же типа и с таким же значением, тогда как для изменяемых объектов это не допустимо. Например, после ``a = 1; b = 1`` , ``a`` и ``b`` могут ссылаться на один и тот же объект, имеющий значение “единица” (а могут и на разные), что зависит от конкретной реализации, но после ``c = []; d = []`` , ``c`` и ``d`` обязательно ссылаются на два различных, уникальных, заново созданных пустых списка. (Заметьте, что ``c = d = []`` присваивает один и тот же объект и ``c`` и ``d`` .)

source: The standard type hierarchy
ru: Иерархия стандартных типов

source: Below is a list of the types that are built into Python. Extension modules (written in C, Java, or other languages, depending on the implementation) can define additional types. Future versions of Python may add types to the type hierarchy (e.g., rational numbers, efficiently stored arrays of integers, etc.), although such additions will often be provided via the standard library instead.
ru: Ниже перечислены типы, встроенные в Питон. Модули расширения (написанные на “C”, “Java”, или других языках - в зависимости от реализации Питона в конкретном случае) могут определять дополнительные типы. Будущие версии Питона могут добавить новые к иерархии типов (напр. рациональные числа, эффективные массивы целых и т.д.), хотя, чаще всего, такие дополнения будут предоставляться с помощью стандартных библиотек.

source: Some of the type descriptions below contain a paragraph listing 'special attributes.' These are attributes that provide access to the implementation and are not intended for general use. Their definition may change in the future.
ru: Некоторые из описаний типов, данные ниже, содержат абзац, перечисляющий “специальные атрибуты”. Это атрибуты, которые предоставляют доступ к внутреннему механизму реализации, и они не предназначены для использования в норме. Их определение может измениться в будущем.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``None``. It is used to signify the absence of a value in many situations, e.g., it is returned from functions that don't explicitly return anything. Its truth value is false.
ru: Этот тип может иметь только единственное значение. И имеется только единственый объект с этим значением. Доступ к этому объекту происходит через встроенное имя «:const:`None`» . Во многих ситуациях он используется, чтобы обозначить отсутствие значения, например он возвращается из функций, которые не возвращают ничего явным образом. «:const:`None`» имеет значение истинности: «:const:`False`» (“ложь”) .

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``NotImplemented``. Numeric methods and rich comparison methods may return this value if they do not implement the operation for the operands provided. (The interpreter will then try the reflected operation, or some other fallback, depending on the operator.) Its truth value is true.
ru: Этот тип может иметь только единственное значение. И имеется только единственый объект с этим значением. Доступ к этому объекту происходит через встроенное имя «:const:`NotImplemented`» . Числовые методы и методы сравнения могут вернуть это значение, если они не имеют реализации данной операции для данных операндов. «:const:`NotImplemented`» имеет значение истинности: «:const:`True`» ("истина") .

source: This type has a single value. There is a single object with this value. This object is accessed through the literal ``...`` or the built-in name ``Ellipsis``. Its truth value is true.
ru: Этот тип может иметь только единственное значение. И имеется только единственый объект с этим значением. Доступ к этому объекту происходит через запись ``...`` (троеточие), или встроенное имя «:const:`Ellipsis`» . «:const:`Ellipsis`» имеет значение истинности: «:const:`True`» ("истина").

source: These are created by numeric literals and returned as results by arithmetic operators and arithmetic built-in functions. Numeric objects are immutable; once created their value never changes. Python numbers are of course strongly related to mathematical numbers, but subject to the limitations of numerical representation in computers.
ru: Объекты этого типа создаются непосредственной записью числа, а также возвращаются как результат арифметическими операторами и арифметическими встроенными функциями. Числовые объекты являются неизменяемыми (“immutable”) - будучи однажды созданным, их значение никогда не меняется. Питоновские числа, конечно, ассоциируются с числами, как они понимаются в математике, только имеют ограничения компьютерного числового представления.

source: Python distinguishes between integers, floating point numbers, and complex numbers:
ru: Питон различает целые, комплексные и числа с плавающей запятой :

source: These represent elements from the mathematical set of integers (positive and negative).
ru: Представляют собой элементы математического множества целых (положительных и отрицательных) .

source: There are two types of integers:
ru: Есть два типа целых :

source: Integers (:class:`int`)
ru: Целые (:class:`int`)

source: These represent numbers in an unlimited range, subject to available (virtual) memory only. For the purpose of shift and mask operations, a binary representation is assumed, and negative numbers are represented in a variant of 2's complement which gives the illusion of an infinite string of sign bits extending to the left.
ru: Этот тип представляет целые числа в теоретически неограниченном диапазоне, ограничиваясь только доступной памятью (виртуальной). При выполнении операций сдвига и маскирования подразумевается двоичная запись числа, и отрицательные числа представлены в варианте двоичного дополнительного кода, который даёт впечатление бесконечного ряда знаковых битов, распространяющихся влево.

source: These represent the truth values False and True. The two objects representing the values False and True are the only Boolean objects. The Boolean type is a subtype of the integer type, and Boolean values behave like the values 0 and 1, respectively, in almost all contexts, the exception being that when converted to a string, the strings ``"False"`` or ``"True"`` are returned, respectively.
ru: Этот тип представляет значения истинности - «:const:`False`» и «:const:`True`» . Только два объекта, представляющие «:const:`False`» и «:const:`True`» , являются булевыми(логическими). Булевый - является подтипом целых, и булевые значения ведут себя как значения “0” и “1” (для «:const:`False`» и «:const:`True`» соответственно) - почти во всех контекстах - с тем исключением, что при конвертации в строку возвращаются строки ``"False"`` или ``"True"`` .

source: The rules for integer representation are intended to give the most meaningful interpretation of shift and mask operations involving negative integers.
ru: Правила представления целых нацелены на наиболее функциональную интерпретацию операций сдвига и маскирования для целых чисел, включая отрицательные.

source: These represent machine-level double precision floating point numbers. You are at the mercy of the underlying machine architecture (and C or Java implementation) for the accepted range and handling of overflow. Python does not support single-precision floating point numbers; the savings in processor and memory usage that are usually the reason for using these is dwarfed by the overhead of using objects in Python, so there is no reason to complicate the language with two kinds of floating point numbers.
ru: Представляют собой машинную реализацию чисел с плавающей запятой двойной точности. Приходится полностью полагаться на архитектуру машины, на которой происходит исполнение (и на реализацию “C” или “Java”) , в отношении диапазона и обработки переполнения. Питон не поддерживает числа с плавающей запятой одинарной точности – экономия ресурсов процессора и памяти, которая обычно является причиной их использования, перечёркивается дополнительными затратами при использовании объектов Питона, так что нет причин усложнять язык двумя видами чисел с плавающей запятой.

source: These represent complex numbers as a pair of machine-level double precision floating point numbers. The same caveats apply as for floating point numbers. The real and imaginary parts of a complex number ``z`` can be retrieved through the read-only attributes ``z.real`` and ``z.imag``.
ru: Этот тип определяет комплексные числа, как пары зависящих от машинной реализации чисел двойной длины с плавающей точкой. Для них действительны те же ограничения, что и для чисел с плавающей точкой. Значения вещественной и мнимой частей комплексного числа ``z`` могут быть получены с помощью атрибутов (только для чтения) ``z.real`` и ``z.imag`` .

source: These represent finite ordered sets indexed by non-negative numbers. The built-in function :func:`len` returns the number of items of a sequence. When the length of a sequence is *n*, the index set contains the numbers 0, 1, ..., *n*-1. Item *i* of sequence *a* is selected by ``a[i]``.
ru: Этот тип представляет ограниченое (не бесконечное) упорядоченое множество, индексированное неотрицательными целыми числами. При длинне последовательности *n* множество индексов содержит числа 0, 1, ..., *n*-1. Элемент *i* последовательности a адресуется записью ``a[i]`` . Встроенная функция :func:`len` возвращает количество элементов в последовательности.

source: Sequences also support slicing: ``a[i:j]`` selects all items with index *k* such that *i* ``<=`` *k* ``<`` *j*. When used as an expression, a slice is a sequence of the same type. This implies that the index set is renumbered so that it starts at 0.
ru: Для последовательностей также доступно вырезание (“срезы”, “slices”). Так ``a[i:j]`` выбирает все элементы с индексом *k*, таким, что *i* ``<=`` *k* ``<`` *j*. При использовании в качестве выражения, срез является последовательностью того же типа, что и исходная последовательность. При этом множество индексов заново перечисляется, начиная с 0.

source: Some sequences also support "extended slicing" with a third "step" parameter: ``a[i:j:k]`` selects all items of *a* with index *x* where ``x = i + n*k``, *n* ``>=`` ``0`` and *i* ``<=`` *x* ``<`` *j*.
ru: Некоторые последовательности также поддерживают “расширенные срезы” с третьим параметром “шаг” . Так ``a[i:j:k]`` выбирает все элементы из *a* с индексом *x* , где ``x = i + n*k`` , *n* ``>=`` ``0`` , *i* ``<=`` *x* ``<`` *j* .

source: Sequences are distinguished according to their mutability:
ru: Последовательности различаются с точки зрения их изменяемости :

source: An object of an immutable sequence type cannot change once it is created. (If the object contains references to other objects, these other objects may be mutable and may be changed; however, the collection of objects directly referenced by an immutable object cannot change.)
ru: Объект принадлежащий к типу неизменяемой последовательности не может изменяться с момента создания. (Если же этот объект содержит ссылки на другие объекты, то уже́́́ эти другие объекты могут оказаться изменяемыми - и могут меняться; однако тот набор объектов, на которые непосредственно ссылается неизменяемый объект, меняться не может.

source: The following types are immutable sequences:
ru: Следующие типы являются неизменяемыми последовательностями :

source: The items of a string object are Unicode code units. A Unicode code unit is represented by a string object of one item and can hold either a 16-bit or 32-bit value representing a Unicode ordinal (the maximum value for the ordinal is given in ``sys.maxunicode``, and depends on how Python is configured at compile time). Surrogate pairs may be present in the Unicode object, and will be reported as two separate items. The built-in functions :func:`chr` and :func:`ord` convert between code units and nonnegative integers representing the Unicode ordinals as defined in the Unicode Standard 3.0. Conversion from and to other encodings are possible through the string method :meth:`encode`.
ru: Элементами текстового (“строкового”) объекта являются элементарные(минимальные) единицы(порции) кода Юникод. Код символа Юникод реализуется текстовым объектом из одного символа и может использовать 16- или 32-битное значение, означающее номер символа Юникод (максимальное значение для этого номера задано в ``sys.maxunicode`` , и зависит от того, как Питон сконфигурирован при компиляции) . Могущие присутствовать в Юникодном объекте “суррогатные пары” будут восприниматься как два отдельных объекта. Встроенные функции «:func:`chr`» и «:func:`ord`» выполняют преобразование между односимвольным текстовым объектом и неотрицательным целым числовым объектом с соответствующим значением номера символа Юникода, как определено в “Unicode Standard 3.0” . Преобазования из и в другие кодировки возможны с помощью метода «:meth:`encode`» .

source: The items of a tuple are arbitrary Python objects. Tuples of two or more items are formed by comma-separated lists of expressions. A tuple of one item (a 'singleton') can be formed by affixing a comma to an expression (an expression by itself does not create a tuple, since parentheses must be usable for grouping of expressions). An empty tuple can be formed by an empty pair of parentheses.
ru: Элементами “кортежа” могут быть любые объекты Питона. Кортежи из двух и более элементов образуются перечнем выражений, разделённых запятыми. Кортеж из одного элемента (“singleton”) может быть образован добавлением запятой после выражения (само выражение без запятой - не создаёт кортеж, поскольку в таком случае скобки обозначают группирование в выражении). Пустой кортеж может быть образован пустой парой скобок.

source: A bytes object is an immutable array. The items are 8-bit bytes, represented by integers in the range 0 <= x < 256. Bytes literals (like ``b'abc'`` and the built-in function :func:`bytes` can be used to construct bytes objects. Also, bytes objects can be decoded to strings via the :meth:`decode` method.
ru: Байтовый объект является неизменяемым массивом. Его элементами являются 8-битовые байты, которые могут быть представлены целыми числами в диапазоне 0 <= x < 256. Для создания байтовых объектов можно использовать непосредственную запись байтов (как например ``b'abc'`` ), или встроенную функцию «:func:`bytes`» . Кроме того, байтовые объекты могут быть перекодированы в строковые с помощью метода «:meth:`decode`» .

source: Mutable sequences can be changed after they are created. The subscription and slicing notations can be used as the target of assignment and :keyword:`del` (delete) statements.
ru: Изменяемые последовательности могут быть изменены после их создания. Обозначения индексации и “среза” могут быть использованы в качестве цели для выражений присваивания и :keyword:`del` (удаления) .

source: There are currently two intrinsic mutable sequence types:
ru: В данной версии есть два типа изменяемых последовательностей:

source: The items of a list are arbitrary Python objects. Lists are formed by placing a comma-separated list of expressions in square brackets. (Note that there are no special cases needed to form lists of length 0 or 1.)
ru: Элементами списка могут быть любые объекты Питона. Списки задаются перечислением выражений через запятую внутри пары квадратных скобок. (Заметьте, что нет специальной формы для списка пустого или с одним элементом.)

source: A bytearray object is a mutable array. They are created by the built-in :func:`bytearray` constructor. Aside from being mutable (and hence unhashable), byte arrays otherwise provide the same interface and functionality as immutable bytes objects.
ru: Объект типа массив байтов является изменяемым массивом. Они создаются встроенным конструктором «:func:`bytearray`» . За исключением изменяемости, байтовые массивы в остальном предоставляют теже интерфейс и функциональность как и неизменяемые байтовые объекты.

source: The extension module :mod:`array` provides an additional example of a mutable sequence type, as does the :mod:`collections` module.
ru: Модулях расширения «:mod:`array`» и «:mod:`collections`» предоставлены дополнительные варианты типов изменяемых последовательностей.

source: These represent unordered, finite sets of unique, immutable objects. As such, they cannot be indexed by any subscript. However, they can be iterated over, and the built-in function :func:`len` returns the number of items in a set. Common uses for sets are fast membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference.
ru: Эти типы представляют неупорядоченные, конечные наборы неповторяющихся объектов. В связи с этим к ним не могут применяться операции выбора элементов по их индексу. Однако элементы наборов могут быть последовательно перебраны (“итерированы”), а также можно получить их количество с помощью встроенной функции «:func:`len`» . Обычно наборы находят применение для быстрого определения вхождения во множество, для удаления повторов из последовательностей и для проведения операций типа пересечения, объединения, разности.

source: For set elements, the same immutability rules apply as for dictionary keys. Note that numeric types obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``), only one of them can be contained in a set.
ru: Для элементов наборов применяются теже правила неизменяемости, как и для ключей словарей. Обратите внимание, что для числовых типов реализуются обычные правила сравнения чисел : если два числа равны (с точки зрения операции сравнения, как например ``1`` и ``1.0`` ), то только одно может присутствовать в наборе.

source: There are currently two intrinsic set types:
ru: В данной версии языка существует два внутренних наборных типа :

source: These represent a mutable set. They are created by the built-in :func:`set` constructor and can be modified afterwards by several methods, such as :meth:`add`.
ru: Этот тип представляет изменяемый набор. Наборы создаются встроенным конструктором «:func:`set`» и впоследствии могут быть изменены с помощью некоторых "методов" - например «:meth:`add`» .

source: These represent an immutable set. They are created by the built-in :func:`frozenset` constructor. As a frozenset is immutable and :term:`hashable`, it can be used again as an element of another set, or as a dictionary key.
ru: Этот тип представляет неизменяемый набор. Они создаются встроенным конструктором «:func:`frozenset`» . Поскольку они неизменяемые и “хешируемые” (“:term:`hashable`”) - они могут в свою очередь быть использованы как элемент другого набора, или как ключ словаря.

source: These represent finite sets of objects indexed by arbitrary index sets. The subscript notation ``a[k]`` selects the item indexed by ``k`` from the mapping ``a``; this can be used in expressions and as the target of assignments or :keyword:`del` statements. The built-in function :func:`len` returns the number of items in a mapping.
ru: Это конечные наборы объектов, индексированных произвольным набором индексов. Запись индексирования (извлечения) «``a[k]``» выбирает элемент, индексированный значением «``k``» , из отображения «``a``» . Такая запись может использоваться в выражениях и как получатель значения или с инструкцией «:keyword:`del`» . Встроенная функция «:func:`len`» возвращает количество элементов в отображении.

source: There is currently a single intrinsic mapping type:
ru: В данной версии есть единственный тип отображения :

source: These represent finite sets of objects indexed by nearly arbitrary values. The only types of values not acceptable as keys are values containing lists or dictionaries or other mutable types that are compared by value rather than by object identity, the reason being that the efficient implementation of dictionaries requires a key's hash value to remain constant. Numeric types used for keys obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``) then they can be used interchangeably to index the same dictionary entry.
ru: Словари - это конечные множества объектов, индексируемых соответственно элементами (которые могут быть практически любыми значениями) другого набора той же длины. Единственными типами значений, недопустимыми в качестве индекса (ключа), являются значения, содержащие списки или словари или другие изменяемые типы, сравнение которых производится по значению, а не по идентификатору, по причине того, что для эффективной реализации словарей требуется, чтобы значения хешей ключей оставались неизменяемыми. для числовых типов, используемых в качестве ключей, реализуются обычные правила сравнения чисел : если два числа равны (с точки зрения операции сравнения, как например ``1`` и ``1.0`` ), то они являются взаимозаменяемыми и любое из них может может быть использовано в качестве ключа к одной и той же записи словаря.

source: Dictionaries are mutable; they can be created by the ``{...}`` notation (see section :ref:`dict`).
ru: Словари являются изменяемыми. Они могут быть созданы с помощью записи «``{...}``» (смотрите раздел :ref:`dict`) .

source: The extension modules :mod:`dbm.ndbm` and :mod:`dbm.gnu` provide additional examples of mapping types, as does the :mod:`collections` module.
ru: В модулях расширения «:mod:`dbm.ndbm`» и «:mod:`dbm.gnu`» , также, как и в «:mod:`collections`» предоставлены дополнительные варианты типов отображений.
